In [1]:
import pandas as pd

## Reading CSV

In [5]:
pd.read_csv('Data/course_offerings.csv') # Press (shift + tab) to see parameter options inside a function

   course_id                  course_name    instructor
0        101              Intro to Python  Chris Bruehl
1        102                 Intro to SQL   John Pauler
2        201    Exploratory Data Analysis    Alice Zhao
3        301                   Algorithms  Chris Bruehl
4        331  Natural Language Processing    Alice Zhao

In [14]:
pd.read_csv(
    'Data/course_offerings.csv', 
    sep=',', # values separated key. Usually a comma ,
    header='infer' # Wheter or not pick the first row as the title row.
)

   course_id                  course_name    instructor
0        101              Intro to Python  Chris Bruehl
1        102                 Intro to SQL   John Pauler
2        201    Exploratory Data Analysis    Alice Zhao
3        301                   Algorithms  Chris Bruehl
4        331  Natural Language Processing    Alice Zhao

## Reading Excel

In [16]:
pd.read_excel('Data/Course Offerings.xlsx', sheet_name=1)

   Course ID                  Course Name    Instructor
0        101              Intro to Python  Chris Bruehl
1        102                 Intro to SQL   John Pauler
2        201    Exploratory Data Analysis    Alice Zhao
3        301                   Algorithms  Chris Bruehl
4        331  Natural Language Processing    Alice Zhao

## Connecting to a SQL Database

SQL Software   |     Database Driver  
------------------------------------  
SQLite         |     sqlite3  
MySQL          |     mysql.connector  
Oracle         |     cx_Oracle  
PostgreSQL     |     psycopg2  
SQL Server     |     pyodbc  


The setup for other software like MySQL, PostgreSQL, Oracle, and SQL Server is more involved.
1. Install a database driver (pip install or conda install)
   * !pip install mysql-connector-python
2. Set up the database connection.

import mysql.connector  
  
conn = mysql.connector.connect(  
    host = 'localhost',  
    database='my_new_db',  
    user='alice',  
    password='password'  
)

3. Write SQL code in python.

pd.read_sql('SELECT * FROM courses WHERE course_id = 101', conn)

In [25]:
import sqlite3

In [19]:
conn = sqlite3.connect('Data/maven.db')
pd.read_sql('SELECT * FROM courses', conn)

   course_id                       course    instructor
0        101              Intro to Python  Chris Bruehl
1        102                 Intro to SQL   John Pauler
2        201    Exploratory Data Analysis    Alice Zhao
3        301                   Algorithms  Chris Bruehl
4        331  Natural Language Processing    Alice Zhao

In [24]:
pd.read_sql('SELECT * FROM courses WHERE course_id = 101', conn)

   course_id           course    instructor
0        101  Intro to Python  Chris Bruehl

## Quickly Exploring a DataFrame

In [28]:
df = pd.read_csv('Data/course_offerings.csv')
df

   course_id                  course_name    instructor
0        101              Intro to Python  Chris Bruehl
1        102                 Intro to SQL   John Pauler
2        201    Exploratory Data Analysis    Alice Zhao
3        301                   Algorithms  Chris Bruehl
4        331  Natural Language Processing    Alice Zhao

In [32]:
df.head(2)

   course_id      course_name    instructor
0        101  Intro to Python  Chris Bruehl
1        102     Intro to SQL   John Pauler

In [33]:
df.tail(2)

   course_id                  course_name    instructor
3        301                   Algorithms  Chris Bruehl
4        331  Natural Language Processing    Alice Zhao

In [35]:
df.shape

(5, 3)

In [36]:
df.count()

course_id      5
course_name    5
instructor     5
dtype: int64

In [37]:
df.describe()

        course_id
count    5.000000
mean   207.200000
std    107.829495
min    101.000000
25%    102.000000
50%    201.000000
75%    301.000000
max    331.000000

In [38]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   course_id    5 non-null      int64
 1   course_name  5 non-null      object
 2   instructor   5 non-null      object
dtypes: int64(1), object(2)
memory usage: 252.0+ bytes